ZoubairGarma/P2M/esp32_cam/src/camera.cpp
#include "camera.h"
#include "config.h"
#include "esp_camera.h"
#include <WebServer.h> // On ajoute la bibliothèque du serveur

// NOUVEAU : On prévient ce fichier que "server" existe déjà dans main.cpp
extern WebServer server;


void initialiserCamera() {
  Serial.println("Initialisation caméra...");

  camera_config_t config;
  
  // Rétrocompatibilité
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR < 3
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
#endif

  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;

  if(psramFound()){
    config.frame_size = FRAMESIZE_VGA;
    config.jpeg_quality = 10;
    config.fb_count = 2;
  } else {
    config.frame_size = FRAMESIZE_QVGA;
    config.jpeg_quality = 12;
    config.fb_count = 1;
  }

  if (esp_camera_init(&config) != ESP_OK) {
    Serial.println("Erreur init caméra !");
    return;
  }
}

void capturePhoto() {
  Serial.println(">>> Page Web demandée ! Prise de photo...");
  if (!accessGranted || millis() - accessGrantedTimestamp > ACCESS_GRANT_DURATION_MS) {
    accessGranted = false;
    Serial.println("Accès refusé : autorisation manquante ou expirée.");
    server.send(403, "text/plain", "Access denied");
    return;
  }
  accessGranted = false;
  camera_fb_t * fb = esp_camera_fb_get();

  if (!fb) {
    Serial.println("Erreur capture");
    server.send(500, "text/plain", "Erreur camera");
    return;
  }

  // MÉTHODE ROBUSTE : On écrit directement dans le flux du client
  WiFiClient client = server.client();
  client.println("HTTP/1.1 200 OK");
  client.println("Content-Type: image/jpeg");
  client.print("Content-Length: ");
  client.println(fb->len);
  client.println(); // Ligne vide obligatoire en HTTP
  
  // Envoi du buffer binaire
  client.write(fb->buf, fb->len);

  esp_camera_fb_return(fb);

  Serial.println("Photo envoyée avec succès !");
}